Siege/logs_ab/log_search_ab_700.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Finished 20694 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15905 bytes

Concurrency Level:      700
Time taken for tests:   60.001 seconds
Complete requests:      20694
Failed requests:        0
Total transferred:      335842926 bytes
HTML transferred:       329138070 bytes
Requests per second:    344.89 [#/sec] (mean)
Time per request:       2029.606 [ms] (mean)
Time per request:       2.899 [ms] (mean, across all concurrent requests)
Transfer rate:          5466.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   5.0      0      36
Processing:    19 1994 219.0   2016    2198
Waiting:        8 1994 219.0   2016    2198
Total:         55 1995 214.3   2017    2198

Percentage of the requests served within a certain time (ms)
  50%   2017
  66%   2027
  75%   2033
  80%   2039
  90%   2105
  95%   2140
  98%   2157
  99%   2161
 100%   2198 (longest request)